In [5]:
import pandas as pd

In [6]:
hr_df = pd.read_csv('../../data/public_data/cleaned/fitbit/cleaned_heart_rate.csv')
hr_df.head()

           Id                 Time  Value
0  2022484408  2016-04-01 07:54:00     93
1  2022484408  2016-04-01 07:54:05     91
2  2022484408  2016-04-01 07:54:10     96
3  2022484408  2016-04-01 07:54:15     98
4  2022484408  2016-04-01 07:54:20    100

### Converting the heart rate data into per minute values

In [7]:
# first converting the time column to datetime data type
hr_df['Time'] = pd.to_datetime(hr_df['Time'])
hr_df['Time']

0         2016-04-01 07:54:00
1         2016-04-01 07:54:05
2         2016-04-01 07:54:10
3         2016-04-01 07:54:15
4         2016-04-01 07:54:20
                  ...
3614910   2016-05-12 14:43:53
3614911   2016-05-12 14:43:58
3614912   2016-05-12 14:44:03
3614913   2016-05-12 14:44:18
3614914   2016-05-12 14:44:28
Name: Time, Length: 3614915, dtype: datetime64[ns]

In [8]:
hr_df.head()

           Id                Time  Value
0  2022484408 2016-04-01 07:54:00     93
1  2022484408 2016-04-01 07:54:05     91
2  2022484408 2016-04-01 07:54:10     96
3  2022484408 2016-04-01 07:54:15     98
4  2022484408 2016-04-01 07:54:20    100

In [9]:
def get_max_hr(group):
    return group['Value'].max()

def get_min_hr(group):
    return group['Value'].min()

max_daily_hr_df = hr_df.groupby(['Id', hr_df['Time'].dt.date]).apply(get_max_hr).to_frame(name='Max Daily Hr')


min_daily_hr_df = hr_df.groupby(['Id', hr_df['Time'].dt.date]).apply(get_min_hr).to_frame(name='Min Daily Hr')

min_max_daily_hr_df = pd.merge(min_daily_hr_df, max_daily_hr_df, right_index=True, left_index=True)
min_max_daily_hr_df

                       Min Daily Hr  Max Daily Hr
Id         Time
2022484408 2016-04-01            53           182
           2016-04-02            49           103
           2016-04-03            49           126
           2016-04-04            54           150
           2016-04-05            53           143
...                             ...           ...
8877689391 2016-05-08            54           137
           2016-05-09            51           176
           2016-05-10            50           141
           2016-05-11            48           180
           2016-05-12            53           122

[469 rows x 2 columns]

In [10]:
len(max_daily_hr_df), len(min_daily_hr_df), len(min_max_daily_hr_df)

(469, 469, 469)

In [11]:
min_max_daily_hr_df.isna().sum()

Min Daily Hr    0
Max Daily Hr    0
dtype: int64

In [12]:
min_max_daily_hr_df.to_csv('../../data/public_data/cleaned/fitbit/cleaned_daily_hr.csv')